{
  "activation": "gelu",
  "architectures": [
    "DistilBertModel"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 32,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 64,
  "initializer_range": 0.02,
  "max_position_embeddings": 128,
  "model_type": "distilbert",
  "n_heads": 2,
  "n_layers": 1,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "vocab_size": 1000
}
